import math  # подключение библиотеки, для округления вещественных чисел

# пример указания импортируемых функцийй библиотеки.
# В этом случае ниже по коду "math" можно не писать
# from math import floor, ceil, sqrt

# from math import *  # импорт всего. Не рекомендуется

print(int(2.5), int(3.5), int(-2.5))  # округляет в сторону нуля (отбрасывет дробную часть). В библиотеке math также есть функция округления trunc, которая работает аналогично int.
print(math.floor(2.5), math.floor(3.5), math.floor(-2.5))  # округляет в меньшую сторону
print(math.ceil(2.5), math.ceil(3.5), math.ceil(-2.5))  # округляет в большую сторону
print(round(2.5), round(3.5), round(-2.5))  # обычное округление для всех чисел, кроме, имеющих 5-десятых. В этом случае, округление в сторону ближайшего четного числа
print(math.sqrt(4))  # корень
