a = input()

print(len(a))  # длина строки

print(a[1])  # обращение к символу в строке. Нумерация с 0. Доступ только на чтение
print(a[-2])  # обращение к символу в строке справа налево. Нумерация от -1

print(a[1:4])  # получение части строки. Правая граница не включается в вывод
print(a[1:])  # вывод до конца строки
print(a[:4])  # вывод с начала строки до символа
print(a[:])  # вывод всей строки
print(a[1:6:2])  # вывод каждого второго символа, до конца строки
print(a[::-1])  # вывод строки справа налево

a.find('abd')  # метод Найти. Если не найдено = -1

# поиск всех вхождений строки в подстроку
pos = 0
str = a.find('abd', pos) # позиция с которой ищем указывается во 2м параметре
while str != -1
    print(str)
    pos = a.find('abd', pos + 1)
